-- =======================================================
-- ЛАБОРАТОРНА РОБОТА №5 (Управління користувачами та ролями)
-- Мова DCL (Data Control Language)
-- =======================================================

-- 1. СТВОРЕННЯ РОЛІ (Створюємо шаблон прав для кадровика)
-- (Тут база видасть помилку ORA-01031: insufficient privileges - це ОЧІКУВАНО!)
CREATE ROLE role_hr_manager;

-- 2. НАДАННЯ ПРАВ РОЛІ (Наповнюємо шаблон конкретними дозволами)
-- Дозволяємо кадровику читати, додавати та змінювати дані в таблиці працівників
GRANT SELECT, INSERT, UPDATE ON employees TO role_hr_manager;

-- Дозволяємо кадровику тільки читати (дивитися) таблицю кваліфікацій
GRANT SELECT ON qualifications TO role_hr_manager;


-- 3. СТВОРЕННЯ КОРИСТУВАЧА (Реєструємо нового працівника HR-відділу)
-- Задаємо йому логін hr_user та пароль hr_pass_123
CREATE USER hr_user IDENTIFIED BY hr_pass_123;

-- 4. НАДАННЯ ПРАВ КОРИСТУВАЧУ (Прив'язка до бази та видача ролі)
-- Даємо базовий дозвіл просто підключатися до бази даних
GRANT CONNECT TO hr_user;

-- Призначаємо нашому новому користувачу всі ті права, що ми зібрали в ролі
GRANT role_hr_manager TO hr_user;


-- 5. ПЕРЕВІРКА (Дивимось, чи з'явився наш кадровик у системному словнику бази)
-- Цей запит виконається без помилок, але покаже порожню таблицю, 
-- оскільки користувач так і не створився через захист (нестачу прав).
SELECT username, account_status, created 
FROM dba_users 
WHERE username = 'HR_USER';