



-- =====================================================================
-- ДІЯ 1: СТВОРЕННЯ РОЛЕЙ (Згідно з вимогою методички)
-- =====================================================================
CREATE ROLE role_hr_director;
CREATE ROLE role_developer;
CREATE ROLE role_auditor;

-- =====================================================================
-- ДІЯ 2: НАДАННЯ ПРИВІЛЕЇВ РОЛЯМ
-- =====================================================================
GRANT SELECT, UPDATE ON qualifications TO role_hr_director;
GRANT SELECT, INSERT ON work_logs TO role_developer;
GRANT SELECT ON audit_rate_history TO role_auditor;

-- =====================================================================
-- ДІЯ 3: СТВОРЕННЯ КОРИСТУВАЧІВ
-- =====================================================================
CREATE USER hr_chief IDENTIFIED BY Pass_123;
CREATE USER dev_junior IDENTIFIED BY Pass_123;
CREATE USER fin_auditor IDENTIFIED BY Pass_123;

-- =====================================================================
-- ДІЯ 4: НАДАННЯ ПРИВІЛЕЇВ КОРИСТУВАЧАМ (Прямі гранти)
-- =====================================================================
-- 1. Даємо всім право підключатися до бази
GRANT CONNECT TO hr_chief, dev_junior, fin_auditor;
-- 2. Демонстрація ПРЯМОГО надання привілею користувачу (без ролі)
GRANT SELECT ON projects TO dev_junior; 

-- =====================================================================
-- ДІЯ 5: ПРИЗНАЧЕННЯ РОЛЕЙ КОРИСТУВАЧАМ
-- =====================================================================
GRANT role_hr_director TO hr_chief;
GRANT role_developer TO dev_junior;
GRANT role_auditor TO fin_auditor;

-- Цей запит покаже трьох твоїх нових користувачів
SELECT username, account_status 
FROM dba_users 
WHERE username IN ('HR_CHIEF', 'DEV_JUNIOR', 'FIN_AUDITOR');


-- =====================================================================
-- ДІЯ 6: ВІДКЛИКАННЯ РОЛЕЙ (Згідно з вимогою методички)
-- =====================================================================
-- Забираємо роль аудитора у користувача fin_auditor
REVOKE role_auditor FROM fin_auditor;

-- =====================================================================
-- ДІЯ 7: ВИДАЛЕННЯ РОЛЕЙ
-- =====================================================================
-- Знищуємо роль аудитора взагалі
DROP ROLE role_auditor;

-- =====================================================================
-- ДІЯ 8: ВИДАЛЕННЯ КОРИСТУВАЧІВ
-- =====================================================================
-- Звільняємо фінансового аудитора (видаляємо користувача з бази)
DROP USER fin_auditor CASCADE;


-- Тепер у базі залишиться лише 2 користувачі з 3-х
SELECT username, account_status 
FROM dba_users 
WHERE username IN ('HR_CHIEF', 'DEV_JUNIOR', 'FIN_AUDITOR');